semicontinuity/embedded/target/stm32f4discovery/firmware/test_hd44780_8wire/app_lcd.c
// $Id$
/*
 * Application specific LCD driver for up to 4 HD44870 LCDs,
 * connected via individual, parallel 8-wire data + 3-wire control buses.
 * ==========================================================================
 * When no operations are performed with LCD at the moment:
 * RS must be set to 0 (command mode; don't remember why it was necessary),
 * RW must be set to 0 (write; don't remember why it was necessary),
 */

/////////////////////////////////////////////////////////////////////////////
// Include files
/////////////////////////////////////////////////////////////////////////////

#include "stm32fxxx_hal.h"
#include "tm_stm32_delay.h"
#include "tm_stm32_gpio.h"

#include "app_lcd.h"

uint32_t mios32_lcd_device = 0;
uint32_t mios32_lcd_column = 0;
uint32_t mios32_lcd_line = 0;

void select_lcd(uint32_t device) {
    mios32_lcd_device = device;
}

/////////////////////////////////////////////////////////////////////////////
// Pins
/////////////////////////////////////////////////////////////////////////////

struct hd44780_pins {
    GPIO_TypeDef *rs_port;
    GPIO_TypeDef *rw_port;
    GPIO_TypeDef *e_port;
    GPIO_TypeDef *data_port;
    uint16_t rs_pin_mask;
    uint16_t rw_pin_mask;
    uint16_t e_pin_mask;
    uint16_t data_pins_offset;
};

#define MIOS32_CLCD_PARALLEL_DISPLAYS 4

#define MIOS32_CLCD_PARALLEL_LCD0_RS_PORT GPIOD
#define MIOS32_CLCD_PARALLEL_LCD0_RS_PIN GPIO_Pin_4
#define MIOS32_CLCD_PARALLEL_LCD0_RW_PORT GPIOD
#define MIOS32_CLCD_PARALLEL_LCD0_RW_PIN GPIO_Pin_7
#define MIOS32_CLCD_PARALLEL_LCD0_E_PORT GPIOD
#define MIOS32_CLCD_PARALLEL_LCD0_E_PIN GPIO_Pin_3
#define MIOS32_CLCD_PARALLEL_LCD0_DATA_PORT GPIOD
#define MIOS32_CLCD_PARALLEL_LCD0_DATA_PINS_OFFSET 8U

#define MIOS32_CLCD_PARALLEL_LCD1_RS_PORT GPIOA
#define MIOS32_CLCD_PARALLEL_LCD1_RS_PIN GPIO_Pin_13
#define MIOS32_CLCD_PARALLEL_LCD1_RW_PORT GPIOA
#define MIOS32_CLCD_PARALLEL_LCD1_RW_PIN GPIO_Pin_14
#define MIOS32_CLCD_PARALLEL_LCD1_E_PORT GPIOA
#define MIOS32_CLCD_PARALLEL_LCD1_E_PIN GPIO_Pin_15
#define MIOS32_CLCD_PARALLEL_LCD1_DATA_PORT GPIOB
#define MIOS32_CLCD_PARALLEL_LCD1_DATA_PINS_OFFSET 0U

#define MIOS32_CLCD_PARALLEL_LCD2_RS_PORT GPIOC
#define MIOS32_CLCD_PARALLEL_LCD2_RS_PIN GPIO_Pin_0
#define MIOS32_CLCD_PARALLEL_LCD2_RW_PORT GPIOC
#define MIOS32_CLCD_PARALLEL_LCD2_RW_PIN GPIO_Pin_2
#define MIOS32_CLCD_PARALLEL_LCD2_E_PORT GPIOC
#define MIOS32_CLCD_PARALLEL_LCD2_E_PIN GPIO_Pin_3
#define MIOS32_CLCD_PARALLEL_LCD2_DATA_PORT GPIOE
#define MIOS32_CLCD_PARALLEL_LCD2_DATA_PINS_OFFSET 0U

#define MIOS32_CLCD_PARALLEL_LCD3_RS_PORT GPIOC
#define MIOS32_CLCD_PARALLEL_LCD3_RS_PIN GPIO_Pin_13
#define MIOS32_CLCD_PARALLEL_LCD3_RW_PORT GPIOA
#define MIOS32_CLCD_PARALLEL_LCD3_RW_PIN GPIO_Pin_3
#define MIOS32_CLCD_PARALLEL_LCD3_E_PORT GPIOA
#define MIOS32_CLCD_PARALLEL_LCD3_E_PIN GPIO_Pin_6
#define MIOS32_CLCD_PARALLEL_LCD3_DATA_PORT GPIOE
#define MIOS32_CLCD_PARALLEL_LCD3_DATA_PINS_OFFSET 8U

// 4-LCD Layout, compatible with DIY-MORE board



#ifndef MIOS32_CLCD_PARALLEL_DISPLAYS
#define MIOS32_CLCD_PARALLEL_DISPLAYS 1
#endif

#ifndef MIOS32_CLCD_PARALLEL_LCD0_RS_PORT
#define MIOS32_CLCD_PARALLEL_LCD0_RS_PORT GPIOD
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD0_RS_PIN
#define MIOS32_CLCD_PARALLEL_LCD0_RS_PIN GPIO_Pin_4
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD0_RW_PORT
#define MIOS32_CLCD_PARALLEL_LCD0_RW_PORT GPIOD
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD0_RW_PIN
#define MIOS32_CLCD_PARALLEL_LCD0_RW_PIN GPIO_Pin_7
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD0_E_PORT
#define MIOS32_CLCD_PARALLEL_LCD0_E_PORT GPIOD
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD0_E_PIN
#define MIOS32_CLCD_PARALLEL_LCD0_E_PIN GPIO_Pin_3
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD0_DATA_PORT
#define MIOS32_CLCD_PARALLEL_LCD0_DATA_PORT GPIOD
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD0_DATA_PINS_OFFSET
#define MIOS32_CLCD_PARALLEL_LCD0_DATA_PINS_OFFSET 8U
#endif


#ifndef MIOS32_CLCD_PARALLEL_LCD1_RS_PORT
#define MIOS32_CLCD_PARALLEL_LCD1_RS_PORT GPIOA
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD1_RS_PIN
#define MIOS32_CLCD_PARALLEL_LCD1_RS_PIN GPIO_Pin_13
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD1_RW_PORT
#define MIOS32_CLCD_PARALLEL_LCD1_RW_PORT GPIOA
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD1_RW_PIN
#define MIOS32_CLCD_PARALLEL_LCD1_RW_PIN GPIO_Pin_14
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD1_E_PORT
#define MIOS32_CLCD_PARALLEL_LCD1_E_PORT GPIOA
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD1_E_PIN
#define MIOS32_CLCD_PARALLEL_LCD1_E_PIN GPIO_Pin_15
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD1_DATA_PORT
#define MIOS32_CLCD_PARALLEL_LCD1_DATA_PORT GPIOB
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD1_DATA_PINS_OFFSET
#define MIOS32_CLCD_PARALLEL_LCD1_DATA_PINS_OFFSET 0U
#endif


#ifndef MIOS32_CLCD_PARALLEL_LCD2_RS_PORT
#define MIOS32_CLCD_PARALLEL_LCD2_RS_PORT GPIOC
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD2_RS_PIN
#define MIOS32_CLCD_PARALLEL_LCD2_RS_PIN GPIO_Pin_0
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD2_RW_PORT
#define MIOS32_CLCD_PARALLEL_LCD2_RW_PORT GPIOC
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD2_RW_PIN
#define MIOS32_CLCD_PARALLEL_LCD2_RW_PIN GPIO_Pin_2
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD2_E_PORT
#define MIOS32_CLCD_PARALLEL_LCD2_E_PORT GPIOC
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD2_E_PIN
#define MIOS32_CLCD_PARALLEL_LCD2_E_PIN GPIO_Pin_3
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD2_DATA_PORT
#define MIOS32_CLCD_PARALLEL_LCD2_DATA_PORT GPIOE
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD2_DATA_PINS_OFFSET
#define MIOS32_CLCD_PARALLEL_LCD2_DATA_PINS_OFFSET 0U
#endif


#ifndef MIOS32_CLCD_PARALLEL_LCD3_RS_PORT
#define MIOS32_CLCD_PARALLEL_LCD3_RS_PORT GPIOC
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD3_RS_PIN
#define MIOS32_CLCD_PARALLEL_LCD3_RS_PIN GPIO_Pin_13
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD3_RW_PORT
#define MIOS32_CLCD_PARALLEL_LCD3_RW_PORT GPIOA
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD3_RW_PIN
#define MIOS32_CLCD_PARALLEL_LCD3_RW_PIN GPIO_Pin_3
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD3_E_PORT
#define MIOS32_CLCD_PARALLEL_LCD3_E_PORT GPIOA
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD3_E_PIN
#define MIOS32_CLCD_PARALLEL_LCD3_E_PIN GPIO_Pin_6
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD3_DATA_PORT
#define MIOS32_CLCD_PARALLEL_LCD3_DATA_PORT GPIOE
#endif
#ifndef MIOS32_CLCD_PARALLEL_LCD3_DATA_PINS_OFFSET
#define MIOS32_CLCD_PARALLEL_LCD3_DATA_PINS_OFFSET 8U
#endif


static struct hd44780_pins displays[MIOS32_CLCD_PARALLEL_DISPLAYS] = {
    {
        .rs_port            = MIOS32_CLCD_PARALLEL_LCD0_RS_PORT,
        .rs_pin_mask        = MIOS32_CLCD_PARALLEL_LCD0_RS_PIN,
        .rw_port            = MIOS32_CLCD_PARALLEL_LCD0_RW_PORT,
        .rw_pin_mask        = MIOS32_CLCD_PARALLEL_LCD0_RW_PIN,
        .e_port             = MIOS32_CLCD_PARALLEL_LCD0_E_PORT,
        .e_pin_mask         = MIOS32_CLCD_PARALLEL_LCD0_E_PIN,
        .data_port          = MIOS32_CLCD_PARALLEL_LCD0_DATA_PORT,
        .data_pins_offset   = MIOS32_CLCD_PARALLEL_LCD0_DATA_PINS_OFFSET,
    },
#if MIOS32_CLCD_PARALLEL_DISPLAYS >= 2
    {
        .rs_port            = MIOS32_CLCD_PARALLEL_LCD1_RS_PORT,
        .rs_pin_mask        = MIOS32_CLCD_PARALLEL_LCD1_RS_PIN,
        .rw_port            = MIOS32_CLCD_PARALLEL_LCD1_RW_PORT,
        .rw_pin_mask        = MIOS32_CLCD_PARALLEL_LCD1_RW_PIN,
        .e_port             = MIOS32_CLCD_PARALLEL_LCD1_E_PORT,
        .e_pin_mask         = MIOS32_CLCD_PARALLEL_LCD1_E_PIN,
        .data_port          = MIOS32_CLCD_PARALLEL_LCD1_DATA_PORT,
        .data_pins_offset   = MIOS32_CLCD_PARALLEL_LCD1_DATA_PINS_OFFSET,
    },
#endif
#if MIOS32_CLCD_PARALLEL_DISPLAYS >= 3
    {
        .rs_port            = MIOS32_CLCD_PARALLEL_LCD2_RS_PORT,
        .rs_pin_mask        = MIOS32_CLCD_PARALLEL_LCD2_RS_PIN,
        .rw_port            = MIOS32_CLCD_PARALLEL_LCD2_RW_PORT,
        .rw_pin_mask        = MIOS32_CLCD_PARALLEL_LCD2_RW_PIN,
        .e_port             = MIOS32_CLCD_PARALLEL_LCD2_E_PORT,
        .e_pin_mask         = MIOS32_CLCD_PARALLEL_LCD2_E_PIN,
        .data_port          = MIOS32_CLCD_PARALLEL_LCD2_DATA_PORT,
        .data_pins_offset   = MIOS32_CLCD_PARALLEL_LCD2_DATA_PINS_OFFSET,
    },
#endif
#if MIOS32_CLCD_PARALLEL_DISPLAYS >= 4
    {
        .rs_port            = MIOS32_CLCD_PARALLEL_LCD3_RS_PORT,
        .rs_pin_mask        = MIOS32_CLCD_PARALLEL_LCD3_RS_PIN,
        .rw_port            = MIOS32_CLCD_PARALLEL_LCD3_RW_PORT,
        .rw_pin_mask        = MIOS32_CLCD_PARALLEL_LCD3_RW_PIN,
        .e_port             = MIOS32_CLCD_PARALLEL_LCD3_E_PORT,
        .e_pin_mask         = MIOS32_CLCD_PARALLEL_LCD3_E_PIN,
        .data_port          = MIOS32_CLCD_PARALLEL_LCD3_DATA_PORT,
        .data_pins_offset   = MIOS32_CLCD_PARALLEL_LCD3_DATA_PINS_OFFSET,
    },
#endif
};


/////////////////////////////////////////////////////////////////////////////
// HD44780 stuff
//
// Write operation
//
// RS:
// --\/--------------------------\/-----
// --/\--------------------------/\-----
//
// RW:
// --\                            /-----
// ---\--------------------------/------
//   |  tAS  |
//
//               PWEH
//           +-------------+                +----------
// E:        |             |                |
// ----------+             +----------------+
//
// DATA:         |  tDSW   | tH  |
// -------------\/--------------\/-----
// -------------/\--------------/\-----
//
// tAS      address set-up time min 40nS
// tcycE    enable cycle time   min 500nS
// PWEH     enable pulse width  min 230nS
// tDSW     data set-up time    min 80nS
// tH       data hold time      min 10nS
/////////////////////////////////////////////////////////////////////////////

#define HD44780_LCD__DONT_USE_BUSY_FLAG             1

#define HD44780_LCD__BUSY_TIMEOUT_CYCLES            100
#define HD44780_LCD__ENABLE_PULSE_WIDTH_US          10
#define HD44780_LCD__ADDRESS_SETUP_TIME_US          1
#define HD44780_LCD__EXECUTION_DELAY_US             40

#define HD44780_LCD__COMMAND__CLEAR                 0x01U
/**
 * Return home sets DDRAM address 0 into the address counter,
 * and returns the display to its original status, if it was shifted. The DDRAM contents do not change.
 * Max execution time 1.52ms
 */
#define HD44780_LCD__COMMAND__RETURN_HOME           0x02U
#define HD44780_LCD__COMMAND__SCREEN                0x04U
#define HD44780_LCD__COMMAND__SCREEN_ADDRESS_INC    0x02U
#define HD44780_LCD__COMMAND__SCREEN_ADDRESS_DEC    0x00U
#define HD44780_LCD__COMMAND__DISPLAY               0x08U
#define HD44780_LCD__COMMAND__DISPLAY_OFF           0x00U
#define HD44780_LCD__COMMAND__DISPLAY_ON            0x04U
#define HD44780_LCD__COMMAND__DISPLAY_CURSOR_OFF    0x00U
#define HD44780_LCD__COMMAND__DISPLAY_CURSOR_ON     0x02U
#define HD44780_LCD__COMMAND__DISPLAY_CURSOR_BLINK  0x01U
#define HD44780_LCD__COMMAND__CONFIGURE             0x20U
#define HD44780_LCD__COMMAND__CONFIGURE_BUS_4_BIT   0x00U
#define HD44780_LCD__COMMAND__CONFIGURE_BUS_8_BIT   0x10U
#define HD44780_LCD__COMMAND__CONFIGURE_LINES_1     0x00U
#define HD44780_LCD__COMMAND__CONFIGURE_LINES_2     0x08U
#define HD44780_LCD__COMMAND__CONFIGURE_CHAR_5X8    0x00U
#define HD44780_LCD__COMMAND__CONFIGURE_CHAR_5X10   0x04U
#define HD44780_LCD__COMMAND__SET_CGRAM_ADDRESS     0x40U
#define HD44780_LCD__COMMAND__SET_DDRAM_ADDRESS     0x80U

#define HD44780_LCD__LINE0_ADDRESS 0x00U
#define HD44780_LCD__LINE1_ADDRESS 0x40U
#define HD44780_LCD__LINE2_ADDRESS 0x14U
#define HD44780_LCD__LINE3_ADDRESS 0x54U

/////////////////////////////////////////////////////////////////////////////
// Generic hd44780 support
/////////////////////////////////////////////////////////////////////////////

/**
 * Initializes Register Select (RS) pin as output.
 */
void hd44780_lcd__register_select__init(const struct hd44780_pins * const lcd) {
    TM_GPIO_Init(lcd->rs_port, lcd->rs_pin_mask, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_Low);
}

void hd44780_lcd__register_select__command(const struct hd44780_pins * const lcd) {
    TM_GPIO_SetPinLow(lcd->rs_port, lcd->rs_pin_mask);
}

void hd44780_lcd__register_select__data(const struct hd44780_pins * const lcd) {
    TM_GPIO_SetPinHigh(lcd->rs_port, lcd->rs_pin_mask);
}


/**
 * Initializes Read/Write (RW) pin as output.
 */
void hd44780_lcd__mode_init(const struct hd44780_pins * const lcd) {
    TM_GPIO_Init(lcd->rw_port, lcd->rw_pin_mask, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_Low);
}

