semicontinuity/embedded/target/stm32f4discovery/firmware/test_hd44780_8wire/app_lcd.c
void hd44780_lcd__mode_read(const struct hd44780_pins * const lcd) {
    TM_GPIO_SetPinHigh(lcd->rw_port, lcd->rw_pin_mask);
}

void hd44780_lcd__mode_write(const struct hd44780_pins * const lcd) {
    TM_GPIO_SetPinLow(lcd->rw_port, lcd->rw_pin_mask);
}


/**
 * Initializes Enable (E) pin as output.
 */
void hd44780_lcd__e__init(const struct hd44780_pins * const lcd) {
    TM_GPIO_Init(lcd->e_port, lcd->e_pin_mask, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_Low);
}

void hd44780_lcd__e_high(const struct hd44780_pins * const lcd) {
    TM_GPIO_SetPinHigh(lcd->e_port, lcd->e_pin_mask);
}

void hd44780_lcd__e_low(const struct hd44780_pins * const lcd) {
    TM_GPIO_SetPinLow(lcd->e_port, lcd->e_pin_mask);
}

void hd44780_lcd__latch_data(const struct hd44780_pins * const lcd) {
    hd44780_lcd__e_high(lcd);
    Delay(10);
    hd44780_lcd__e_low(lcd);
}


/**
 * Switches data pins to outputs.
 */
void hd44780_lcd__data_port__mode_write(const struct hd44780_pins * const lcd) {
    TM_GPIO_Init(lcd->data_port, 0xFFU << lcd->data_pins_offset, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_Low);
}

#if !defined(HD44780_LCD__DONT_USE_BUSY_FLAG) || HD44780_LCD__DONT_USE_BUSY_FLAG==0
/**
 * Switches data pins to inputs, with pull-ups.
 */
void hd44780_lcd__data_port__mode_read(const struct hd44780_pins * const lcd) {
    GPIO_InitTypeDef lcd0__GPIO_InitStructure;
    GPIO_StructInit(&lcd0__GPIO_InitStructure);
    lcd0__GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    lcd0__GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz; // weak driver to reduce transients
    lcd0__GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    lcd0__GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    lcd0__GPIO_InitStructure.GPIO_Pin = 0xFFU << lcd->data_pins_offset;
    GPIO_Init(lcd->data_port, &lcd0__GPIO_InitStructure);
}

/**
 * Switches data pins to inputs, without pull-ups.
 */
void hd44780_lcd__data_port__mode_hi(const struct hd44780_pins * const lcd) {
    GPIO_InitTypeDef lcd0__GPIO_InitStructure;
    GPIO_StructInit(&lcd0__GPIO_InitStructure);
    lcd0__GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    lcd0__GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz; // weak driver to reduce transients
    lcd0__GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    lcd0__GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    lcd0__GPIO_InitStructure.GPIO_Pin = 0xFFU << lcd->data_pins_offset;
    GPIO_Init(lcd->data_port, &lcd0__GPIO_InitStructure);
}
#endif

/**
 * Writes a byte of data to the data pins.
 */
void hd44780_lcd__data_port__write(const struct hd44780_pins *const lcd, const uint8_t value) {
    lcd->data_port->ODR = (uint16_t) (value << lcd->data_pins_offset)
        | (lcd->data_port->ODR & ~(0xFFU << lcd->data_pins_offset));
}

#if !defined(HD44780_LCD__DONT_USE_BUSY_FLAG) || HD44780_LCD__DONT_USE_BUSY_FLAG==0
uint8_t hd44780_lcd__is_busy(const struct hd44780_pins * const lcd) {
    return MIOS32_SYS_STM_PINGET(lcd->data_port, 1U << (lcd->data_pins_offset + 7U));
}


s32 hd44780_lcd__wait_until_not_busy(const struct hd44780_pins *const lcd, s32 time_out) {
    s32 result = -1;
    hd44780_lcd__data_port__mode_read(lcd);
    hd44780_lcd__mode_read(lcd);
    while (time_out > 0) {
        hd44780_lcd__e_high(lcd);
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");

        if (!hd44780_lcd__is_busy(lcd)) {
            time_out = 0;
            result = 0;
        }

        hd44780_lcd__e_low(lcd);
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");
        __asm__ __volatile__("nop");

        --time_out;
    }
    hd44780_lcd__mode_write(lcd);
    // data pins remain in read mode
    return result;
}
#endif

/**
 * Sends a byte to LCD.
 * If Busy flag is used, data pins are normally kept in high-Z mode, so need to switch to Output mode for the write.
 */
void hd44780_lcd__send_byte(const struct hd44780_pins * const lcd, const uint8_t i) {
#ifndef HD44780_LCD__DONT_USE_BUSY_FLAG
    hd44780_lcd__data_port__mode_write(lcd);
#endif
    hd44780_lcd__data_port__write(lcd, i);
    hd44780_lcd__latch_data(lcd);
#ifndef HD44780_LCD__DONT_USE_BUSY_FLAG
    hd44780_lcd__data_port__mode_hi(lcd);
#endif
}

s32 hd44780_lcd__send_command(const struct hd44780_pins * const lcd, const uint8_t i) {
#ifdef HD44780_LCD__DONT_USE_BUSY_FLAG
    Delay(40);
#else
    if (hd44780_lcd__wait_until_not_busy(lcd, HD44780_LCD__BUSY_TIMEOUT_CYCLES) < 0) return -1;
#endif
    hd44780_lcd__send_byte(lcd, i);
    return 0;
}

s32 hd44780_lcd__send_data(const struct hd44780_pins * const lcd, const uint8_t i) {
#ifdef HD44780_LCD__DONT_USE_BUSY_FLAG
    Delay(40);  // to complete previous operation, if any
#else
    if (hd44780_lcd__wait_until_not_busy(lcd, HD44780_LCD__BUSY_TIMEOUT_CYCLES) < 0) return -1;
#endif

