semicontinuity/embedded/target/stm32f4discovery/firmware/test_hd44780_8wire/app_lcd.c
    hd44780_lcd__register_select__data(lcd);
    Delay(1);
    hd44780_lcd__send_byte(lcd, i);
    hd44780_lcd__register_select__command(lcd);
    return 0;
}


void hd44780_lcd__init0(const struct hd44780_pins *const lcd) {
    hd44780_lcd__data_port__mode_write(lcd);
    hd44780_lcd__data_port__write(lcd, 0);

    hd44780_lcd__e__init(lcd);
    hd44780_lcd__e_low(lcd);

    hd44780_lcd__mode_init(lcd);
    hd44780_lcd__mode_write(lcd);

    hd44780_lcd__register_select__init(lcd);
    hd44780_lcd__register_select__command(lcd);
}

void hd44780_lcd__init1(const struct hd44780_pins *const lcd) {
    uint8_t i = 0;
    while (i < 30) {
        hd44780_lcd__data_port__write(lcd, HD44780_LCD__COMMAND__CONFIGURE | HD44780_LCD__COMMAND__CONFIGURE_BUS_8_BIT);
        Delay(200);
        hd44780_lcd__latch_data(lcd);
        Delay(5000);
        i++;
    }
}

s32 hd44780_lcd__init2(const struct hd44780_pins * const lcd) {
    return hd44780_lcd__send_command(lcd, HD44780_LCD__COMMAND__CONFIGURE | HD44780_LCD__COMMAND__CONFIGURE_BUS_8_BIT | HD44780_LCD__COMMAND__CONFIGURE_LINES_2 | HD44780_LCD__COMMAND__CONFIGURE_CHAR_5X8);
}
s32 hd44780_lcd__init3(const struct hd44780_pins * const lcd) {
    return hd44780_lcd__send_command(lcd, HD44780_LCD__COMMAND__DISPLAY | HD44780_LCD__COMMAND__DISPLAY_ON | HD44780_LCD__COMMAND__DISPLAY_CURSOR_OFF);
}
s32 hd44780_lcd__init4(const struct hd44780_pins * const lcd) {
    return hd44780_lcd__send_command(lcd, HD44780_LCD__COMMAND__SCREEN | HD44780_LCD__COMMAND__SCREEN_ADDRESS_INC);
}
s32 hd44780_lcd__init5(const struct hd44780_pins * const lcd) {
    return hd44780_lcd__send_command(lcd, HD44780_LCD__COMMAND__RETURN_HOME);
}
s32 hd44780_lcd__init6(const struct hd44780_pins * const lcd) {
    return hd44780_lcd__send_command(lcd, HD44780_LCD__COMMAND__CLEAR);
}


s32 hd44780_lcd__init(const struct hd44780_pins * const lcd) {
    hd44780_lcd__init0(lcd);

    Delay(8000);

    hd44780_lcd__init1(lcd);

    Delay(8000);

    if (hd44780_lcd__init2(lcd) < 0) {
        return -1;
    }
    Delay(8000);
    if (hd44780_lcd__init3(lcd) < 0) {
        return -1;
    }
    Delay(8000);
    if (hd44780_lcd__init4(lcd) < 0) {
        return -1;
    }
    Delay(8000);
    if (hd44780_lcd__init5(lcd) < 0) {
        return -1;
    }

    // according to data sheet, max execution time of RETURN_HOME is 1.52ms

    Delay(8000);
    if (hd44780_lcd__init6(lcd) < 0) {
        return -1;
    }
    Delay(8000);
    return 0;
    // data pins will remain in high-Z mode (if using busy flag)
}


void hd44780_lcd__goto(const struct hd44780_pins * const lcd, const uint8_t x, const uint8_t y) {
    uint8_t command;
    switch (y) {
    case 0: command = (HD44780_LCD__COMMAND__SET_DDRAM_ADDRESS | HD44780_LCD__LINE0_ADDRESS) + x;
        break;
    case 1: command = (HD44780_LCD__COMMAND__SET_DDRAM_ADDRESS | HD44780_LCD__LINE1_ADDRESS) + x;
        break;
    case 2: command = (HD44780_LCD__COMMAND__SET_DDRAM_ADDRESS | HD44780_LCD__LINE2_ADDRESS) + x;
        break;
    case 3: command = (HD44780_LCD__COMMAND__SET_DDRAM_ADDRESS | HD44780_LCD__LINE3_ADDRESS) + x;
        break;
    default: command = (HD44780_LCD__COMMAND__SET_DDRAM_ADDRESS | HD44780_LCD__LINE0_ADDRESS) + x;
    }

    hd44780_lcd__send_command(lcd, command);
}


/////////////////////////////////////////////////////////////////////////////
// APP_LCD API implementation
/////////////////////////////////////////////////////////////////////////////


/////////////////////////////////////////////////////////////////////////////
// Initializes application specific LCD driver
// IN: <mode>: optional configuration
// OUT: returns < 0 if initialisation failed
/////////////////////////////////////////////////////////////////////////////
s32 APP_LCD_Init(u32 mode) {
    return hd44780_lcd__init(&displays[mios32_lcd_device]);
}


/////////////////////////////////////////////////////////////////////////////
// Sends data byte to LCD
// IN: data byte in <data>
// OUT: returns < 0 if display not available or timed out
/////////////////////////////////////////////////////////////////////////////
s32 APP_LCD_Data(u8 data) {
    return hd44780_lcd__send_data(&displays[mios32_lcd_device], data);
}


/////////////////////////////////////////////////////////////////////////////
// Sends command byte to LCD
// IN: command byte in <cmd>
// OUT: returns < 0 if display not available or timed out
/////////////////////////////////////////////////////////////////////////////
s32 APP_LCD_Cmd(u8 cmd) {
    return hd44780_lcd__send_command(&displays[mios32_lcd_device], cmd);
}


/////////////////////////////////////////////////////////////////////////////
// Clear Screen
// IN: -
// OUT: returns < 0 on errors
/////////////////////////////////////////////////////////////////////////////
s32 APP_LCD_Clear(void) {
    return hd44780_lcd__send_command(&displays[mios32_lcd_device], HD44780_LCD__COMMAND__CLEAR);
}


/////////////////////////////////////////////////////////////////////////////
// Sets cursor to given position
// IN: <column> and <line>
// OUT: returns < 0 on errors
/////////////////////////////////////////////////////////////////////////////
s32 APP_LCD_CursorSet(u16 column, u16 line) {
    hd44780_lcd__goto(&displays[mios32_lcd_device], column, line);
    return 0;
}


/////////////////////////////////////////////////////////////////////////////
// Initializes a single special character
// IN: character number (0-7) in <num>, pattern in <table[8]>
// OUT: returns < 0 on errors
/////////////////////////////////////////////////////////////////////////////
s32 APP_LCD_SpecialCharInit(u8 num, u8 table[8]) {
    s32 i;

    // send command with CGRAM base address for given character
    APP_LCD_Cmd(((num & 7U) << 3U) | HD44780_LCD__COMMAND__SET_CGRAM_ADDRESS);

    // send 8 data bytes
    for (i = 0; i < 8; ++i)
        if (APP_LCD_Data(table[i]) < 0)
            return -1; // error during sending character

    // set cursor to original position
    return APP_LCD_CursorSet(mios32_lcd_column, mios32_lcd_line);
}
